; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-8-39)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p1-3 - location
	p1-4 - location
	p2-1 - location
	p2-5 - location
	p3-4 - location
	p4-2 - location
	p5-0 - location
	p5-6 - location
	p6-3 - location
	p6-4 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s2)
	(at driver3 s5)
	(at driver4 s6)
	(at driver5 s6)
	(at driver6 s1)
	(at driver7 s5)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s4)
	(empty truck5)
	(at truck6 s6)
	(empty truck6)
	(at truck7 s0)
	(empty truck7)
	(at truck8 s4)
	(empty truck8)
	(at package1 s5)
	(at package2 s2)
	(at package3 s0)
	(at package4 s0)
	(at package5 s6)
	(at package6 s5)
	(at package7 s6)
	(at package8 s0)
	(at package9 s2)
	(at package10 s6)
	(at package11 s0)
	(at package12 s3)
	(at package13 s1)
	(at package14 s1)
	(at package15 s4)
	(at package16 s3)
	(at package17 s1)
	(at package18 s0)
	(at package19 s0)
	(at package20 s1)
	(at package21 s1)
	(at package22 s2)
	(at package23 s3)
	(at package24 s1)
	(at package25 s5)
	(at package26 s6)
	(at package27 s6)
	(at package28 s1)
	(at package29 s5)
	(at package30 s5)
	(at package31 s5)
	(at package32 s3)
	(at package33 s3)
	(at package34 s3)
	(at package35 s5)
	(at package36 s1)
	(at package37 s3)
	(at package38 s4)
	(at package39 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(link s0 s5)
	(link s5 s0)
	(link s0 s6)
	(link s6 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s3)
	(link s3 s1)
	(link s1 s4)
	(link s4 s1)
	(link s1 s5)
	(link s5 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s1)
	(link s1 s2)
	(link s2 s6)
	(link s6 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s5)
	(link s5 s3)
	(link s3 s6)
	(link s6 s3)
	(link s4 s2)
	(link s2 s4)
	(link s4 s5)
	(link s5 s4)
	(link s6 s4)
	(link s4 s6)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s1)
	(at driver4 s1)
	(at driver6 s2)
	(at driver7 s1)
	(at truck2 s2)
	(at truck3 s2)
	(at truck7 s0)
	(at package1 s0)
	(at package2 s6)
	(at package3 s4)
	(at package4 s6)
	(at package5 s4)
	(at package6 s5)
	(at package7 s2)
	(at package9 s3)
	(at package11 s5)
	(at package12 s0)
	(at package13 s0)
	(at package14 s1)
	(at package15 s1)
	(at package16 s6)
	(at package17 s5)
	(at package18 s6)
	(at package21 s1)
	(at package22 s5)
	(at package24 s1)
	(at package25 s6)
	(at package26 s2)
	(at package27 s3)
	(at package29 s5)
	(at package30 s0)
	(at package31 s2)
	(at package32 s5)
	(at package33 s1)
	(at package34 s2)
	(at package35 s1)
	(at package36 s1)
	(at package37 s0)
	(at package38 s1)
	(at package39 s6)
	))


)

; plan
1. (load-truck s4 package39 truck1)
   deleted: (at package39 s4)
   added: (in package39 truck1)
   goals met: 8 of 41
2. (load-truck s4 package38 truck1)
   deleted: (at package38 s4)
   added: (in package38 truck1)
   goals met: 8 of 41
3. (load-truck s4 package15 truck1)
   deleted: (at package15 s4)
   added: (in package15 truck1)
   goals met: 8 of 41
4. (load-truck s0 package4 truck4)
   deleted: (at package4 s0)
   added: (in package4 truck4)
   goals met: 8 of 41
5. (load-truck s0 package18 truck4)
   deleted: (at package18 s0)
   added: (in package18 truck4)
   goals met: 8 of 41
6. (load-truck s0 package11 truck4)
   deleted: (at package11 s0)
   added: (in package11 truck4)
   goals met: 8 of 41
7. (board-truck driver4 s6 truck6)
   deleted: (at driver4 s6) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 8 of 41
8. (unload-truck s4 package39 truck1)
   deleted: (in package39 truck1)
   added: (at package39 s4)
   goals met: 8 of 41
9. (unload-truck s4 package38 truck1)
   deleted: (in package38 truck1)
   added: (at package38 s4)
   goals met: 8 of 41
10. (unload-truck s4 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s4)
   goals met: 8 of 41
11. (unload-truck s0 package4 truck4)
   deleted: (in package4 truck4)
   added: (at package4 s0)
   goals met: 8 of 41
12. (unload-truck s0 package18 truck4)
   deleted: (in package18 truck4)
   added: (at package18 s0)
   goals met: 8 of 41
13. (unload-truck s0 package11 truck4)
   deleted: (in package11 truck4)
   added: (at package11 s0)
   goals met: 8 of 41
14. (drive-truck driver4 s6 s0 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s0)
   goals met: 8 of 41
15. (drive-truck driver4 s0 s3 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   goals met: 8 of 41
16. (load-truck s3 package37 truck6)
   deleted: (at package37 s3)
   added: (in package37 truck6)
   goals met: 8 of 41
17. (load-truck s3 package34 truck6)
   deleted: (at package34 s3)
   added: (in package34 truck6)
   goals met: 8 of 41
18. (drive-truck driver4 s3 s0 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   goals met: 8 of 41
19. (load-truck s0 package4 truck6)
   deleted: (at package4 s0)
   added: (in package4 truck6)
   goals met: 8 of 41
20. (unload-truck s0 package37 truck6)
   deleted: (in package37 truck6)
   added: (at package37 s0)
   goals met: 9 of 41
21. (load-truck s0 package3 truck6)
   deleted: (at package3 s0)
   added: (in package3 truck6)
   goals met: 9 of 41
22. (drive-truck driver4 s0 s3 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   goals met: 9 of 41
23. (load-truck s3 package33 truck6)
   deleted: (at package33 s3)
   added: (in package33 truck6)
   goals met: 9 of 41
24. (drive-truck driver4 s3 s1 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s1)
   goals met: 9 of 41
25. (drive-truck driver4 s1 s4 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   goals met: 9 of 41
26. (load-truck s4 package39 truck6)
   deleted: (at package39 s4)
   added: (in package39 truck6)
   goals met: 9 of 41
27. (load-truck s4 package38 truck6)
   deleted: (at package38 s4)
   added: (in package38 truck6)
   goals met: 9 of 41
28. (drive-truck driver4 s4 s1 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   goals met: 9 of 41
29. (drive-truck driver4 s1 s0 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s0)
   goals met: 9 of 41
30. (load-truck s0 package18 truck6)
   deleted: (at package18 s0)
   added: (in package18 truck6)
   goals met: 9 of 41
31. (drive-truck driver4 s0 s3 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   goals met: 9 of 41
32. (load-truck s3 package32 truck6)
   deleted: (at package32 s3)
   added: (in package32 truck6)
   goals met: 9 of 41
33. (load-truck s3 package16 truck6)
   deleted: (at package16 s3)
   added: (in package16 truck6)
   goals met: 9 of 41
34. (drive-truck driver4 s3 s0 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   goals met: 9 of 41
35. (load-truck s0 package11 truck6)
   deleted: (at package11 s0)
   added: (in package11 truck6)
   goals met: 9 of 41
36. (load-truck s2 package9 truck2)
   deleted: (at package9 s2)
   added: (in package9 truck2)
   goals met: 9 of 41
37. (board-truck driver2 s2 truck2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 9 of 41
38. (drive-truck driver4 s0 s1 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s1)
   goals met: 9 of 41
39. (drive-truck driver4 s1 s4 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   goals met: 9 of 41
40. (unload-truck s4 package3 truck6)
   deleted: (in package3 truck6)
   added: (at package3 s4)
   goals met: 10 of 41
41. (drive-truck driver4 s4 s5 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   goals met: 10 of 41
42. (load-truck s5 package35 truck6)
   deleted: (at package35 s5)
   added: (in package35 truck6)
   goals met: 10 of 41
43. (drive-truck driver4 s5 s1 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s1)
   goals met: 10 of 41
44. (unload-truck s1 package38 truck6)
   deleted: (in package38 truck6)
   added: (at package38 s1)
   goals met: 11 of 41
45. (unload-truck s1 package35 truck6)
   deleted: (in package35 truck6)
   added: (at package35 s1)
   goals met: 12 of 41
46. (drive-truck driver4 s1 s4 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   goals met: 12 of 41
47. (load-truck s4 package15 truck6)
   deleted: (at package15 s4)
   added: (in package15 truck6)
   goals met: 12 of 41
48. (drive-truck driver4 s4 s1 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   goals met: 12 of 41
49. (unload-truck s1 package33 truck6)
   deleted: (in package33 truck6)
   added: (at package33 s1)
   goals met: 13 of 41
50. (drive-truck driver4 s1 s5 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s5)
   goals met: 13 of 41
51. (unload-truck s5 package32 truck6)
   deleted: (in package32 truck6)
   added: (at package32 s5)
   goals met: 14 of 41
52. (load-truck s5 package31 truck6)
   deleted: (at package31 s5)
   added: (in package31 truck6)
   goals met: 14 of 41
53. (drive-truck driver4 s5 s1 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s1)
   goals met: 14 of 41
54. (load-truck s1 package17 truck6)
   deleted: (at package17 s1)
   added: (in package17 truck6)
   goals met: 14 of 41
55. (drive-truck driver4 s1 s4 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   goals met: 14 of 41
56. (drive-truck driver4 s4 s6 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s6)
   goals met: 14 of 41
57. (load-truck s6 package7 truck6)
   deleted: (at package7 s6)
   added: (in package7 truck6)
   goals met: 14 of 41
58. (load-truck s6 package5 truck6)
   deleted: (at package5 s6)
   added: (in package5 truck6)
   goals met: 14 of 41
59. (drive-truck driver4 s6 s4 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s4)
   goals met: 14 of 41
60. (unload-truck s4 package5 truck6)
   deleted: (in package5 truck6)
   added: (at package5 s4)
   goals met: 15 of 41
61. (drive-truck driver2 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 14 of 41
62. (drive-truck driver4 s4 s2 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s2)
   goals met: 14 of 41
63. (unload-truck s2 package7 truck6)
   deleted: (in package7 truck6)
   added: (at package7 s2)
   goals met: 15 of 41
64. (unload-truck s2 package34 truck6)
   deleted: (in package34 truck6)
   added: (at package34 s2)
   goals met: 16 of 41
65. (drive-truck driver4 s2 s6 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s6)
   goals met: 16 of 41
66. (unload-truck s6 package4 truck6)
   deleted: (in package4 truck6)
   added: (at package4 s6)
   goals met: 17 of 41
67. (unload-truck s6 package39 truck6)
   deleted: (in package39 truck6)
   added: (at package39 s6)
   goals met: 18 of 41
68. (drive-truck driver4 s6 s2 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s2)
   goals met: 18 of 41
69. (unload-truck s2 package31 truck6)
   deleted: (in package31 truck6)
   added: (at package31 s2)
   goals met: 19 of 41
70. (drive-truck driver4 s2 s4 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s4)
   goals met: 19 of 41
71. (load-truck s1 package13 truck2)
   deleted: (at package13 s1)
   added: (in package13 truck2)
   goals met: 19 of 41
72. (drive-truck driver2 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 19 of 41
73. (load-truck s5 package30 truck2)
   deleted: (at package30 s5)
   added: (in package30 truck2)
   goals met: 19 of 41
74. (drive-truck driver2 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 19 of 41
75. (drive-truck driver4 s4 s5 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   goals met: 19 of 41
76. (load-truck s5 package25 truck6)
   deleted: (at package25 s5)
   added: (in package25 truck6)
   goals met: 19 of 41
77. (drive-truck driver4 s5 s4 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s4)
   goals met: 19 of 41
78. (unload-truck s0 package30 truck2)
   deleted: (in package30 truck2)
   added: (at package30 s0)
   goals met: 20 of 41
79. (unload-truck s0 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s0)
   goals met: 21 of 41
80. (drive-truck driver2 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 21 of 41
81. (walk driver1 s3 p1-3)
   deleted: (at driver1 s3)
   added: (at driver1 p1-3)
   goals met: 21 of 41
82. (walk driver1 p1-3 s1)
   deleted: (at driver1 p1-3)
   added: (at driver1 s1)
   goals met: 22 of 41
83. (walk driver6 s1 p2-1)
   deleted: (at driver6 s1)
   added: (at driver6 p2-1)
   goals met: 22 of 41
84. (walk driver6 p2-1 s2)
   deleted: (at driver6 p2-1)
   added: (at driver6 s2)
   goals met: 23 of 41
85. (walk driver7 s5 p5-0)
   deleted: (at driver7 s5)
   added: (at driver7 p5-0)
   goals met: 23 of 41
86. (walk driver7 p5-0 s0)
   deleted: (at driver7 p5-0)
   added: (at driver7 s0)
   goals met: 23 of 41
87. (walk driver7 s0 p0-1)
   deleted: (at driver7 s0)
   added: (at driver7 p0-1)
   goals met: 23 of 41
88. (walk driver7 p0-1 s1)
   deleted: (at driver7 p0-1)
   added: (at driver7 s1)
   goals met: 24 of 41
89. (drive-truck driver4 s4 s6 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s6)
   goals met: 24 of 41
90. (load-truck s6 package27 truck6)
   deleted: (at package27 s6)
   added: (in package27 truck6)
   goals met: 24 of 41
91. (drive-truck driver4 s6 s3 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s3)
   goals met: 24 of 41
92. (unload-truck s3 package27 truck6)
   deleted: (in package27 truck6)
   added: (at package27 s3)
   goals met: 25 of 41
93. (load-truck s3 package12 truck6)
   deleted: (at package12 s3)
   added: (in package12 truck6)
   goals met: 25 of 41
94. (drive-truck driver4 s3 s0 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   goals met: 25 of 41
95. (unload-truck s0 package12 truck6)
   deleted: (in package12 truck6)
   added: (at package12 s0)
   goals met: 26 of 41
96. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 27 of 41
97. (load-truck s2 package22 truck2)
   deleted: (at package22 s2)
   added: (in package22 truck2)
   goals met: 27 of 41
98. (drive-truck driver2 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 26 of 41
99. (drive-truck driver4 s0 s6 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s6)
   goals met: 26 of 41
100. (drive-truck driver4 s6 s4 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s4)
   goals met: 26 of 41
101. (drive-truck driver2 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 26 of 41
102. (unload-truck s5 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s5)
   goals met: 27 of 41
103. (drive-truck driver2 s5 s1 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   goals met: 27 of 41
104. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 28 of 41
105. (load-truck s2 package2 truck2)
   deleted: (at package2 s2)
   added: (in package2 truck2)
   goals met: 28 of 41
106. (drive-truck driver2 s2 s6 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   goals met: 27 of 41
107. (load-truck s6 package26 truck2)
   deleted: (at package26 s6)
   added: (in package26 truck2)
   goals met: 27 of 41
108. (drive-truck driver2 s6 s2 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   goals met: 28 of 41
109. (unload-truck s2 package26 truck2)
   deleted: (in package26 truck2)
   added: (at package26 s2)
   goals met: 29 of 41
110. (drive-truck driver2 s2 s6 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   goals met: 28 of 41
111. (unload-truck s6 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s6)
   goals met: 29 of 41
112. (drive-truck driver2 s6 s2 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   goals met: 30 of 41
113. (drive-truck driver2 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 29 of 41
114. (drive-truck driver4 s4 s5 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   goals met: 29 of 41
115. (unload-truck s5 package17 truck6)
   deleted: (in package17 truck6)
   added: (at package17 s5)
   goals met: 30 of 41
116. (drive-truck driver4 s5 s4 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s4)
   goals met: 30 of 41
117. (drive-truck driver4 s4 s6 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s6)
   goals met: 30 of 41
118. (unload-truck s6 package25 truck6)
   deleted: (in package25 truck6)
   added: (at package25 s6)
   goals met: 31 of 41
119. (drive-truck driver4 s6 s4 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s4)
   goals met: 31 of 41
120. (drive-truck driver4 s4 s1 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   goals met: 31 of 41
121. (unload-truck s1 package15 truck6)
   deleted: (in package15 truck6)
   added: (at package15 s1)
   goals met: 32 of 41
122. (drive-truck driver4 s1 s4 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   goals met: 32 of 41
123. (drive-truck driver4 s4 s5 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   goals met: 32 of 41
124. (unload-truck s5 package11 truck6)
   deleted: (in package11 truck6)
   added: (at package11 s5)
   goals met: 33 of 41
125. (drive-truck driver4 s5 s4 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s4)
   goals met: 33 of 41
126. (drive-truck driver4 s4 s6 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s6)
   goals met: 33 of 41
127. (unload-truck s6 package18 truck6)
   deleted: (in package18 truck6)
   added: (at package18 s6)
   goals met: 34 of 41
128. (unload-truck s6 package16 truck6)
   deleted: (in package16 truck6)
   added: (at package16 s6)
   goals met: 35 of 41
129. (drive-truck driver4 s6 s4 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s4)
   goals met: 35 of 41
130. (disembark-truck driver4 s4 truck6)
   deleted: (driving driver4 truck6)
   added: (at driver4 s4) (empty truck6)
   goals met: 35 of 41
131. (drive-truck driver2 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 35 of 41
132. (unload-truck s3 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s3)
   goals met: 36 of 41
133. (drive-truck driver2 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 36 of 41
134. (drive-truck driver2 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 36 of 41
135. (load-truck s5 package1 truck2)
   deleted: (at package1 s5)
   added: (in package1 truck2)
   goals met: 36 of 41
136. (drive-truck driver2 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 36 of 41
137. (drive-truck driver2 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 36 of 41
138. (walk driver4 s4 p1-4)
   deleted: (at driver4 s4)
   added: (at driver4 p1-4)
   goals met: 36 of 41
139. (walk driver4 p1-4 s1)
   deleted: (at driver4 p1-4)
   added: (at driver4 s1)
   goals met: 37 of 41
140. (drive-truck driver2 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 37 of 41
141. (disembark-truck driver2 s4 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s4) (empty truck2)
   goals met: 37 of 41
142. (board-truck driver2 s4 truck3)
   deleted: (at driver2 s4) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 37 of 41
143. (unload-truck s4 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s4)
   goals met: 37 of 41
144. (disembark-truck driver2 s4 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 37 of 41
145. (load-truck s4 package1 truck8)
   deleted: (at package1 s4)
   added: (in package1 truck8)
   goals met: 37 of 41
146. (board-truck driver2 s4 truck8)
   deleted: (at driver2 s4) (empty truck8)
   added: (driving driver2 truck8)
   goals met: 37 of 41
147. (drive-truck driver2 s4 s1 truck8)
   deleted: (at truck8 s4)
   added: (at truck8 s1)
   goals met: 37 of 41
148. (walk driver6 s2 p4-2)
   deleted: (at driver6 s2)
   added: (at driver6 p4-2)
   goals met: 36 of 41
149. (walk driver6 p4-2 s4)
   deleted: (at driver6 p4-2)
   added: (at driver6 s4)
   goals met: 36 of 41
150. (drive-truck driver2 s1 s0 truck8)
   deleted: (at truck8 s1)
   added: (at truck8 s0)
   goals met: 36 of 41
151. (unload-truck s0 package1 truck8)
   deleted: (in package1 truck8)
   added: (at package1 s0)
   goals met: 37 of 41
152. (drive-truck driver2 s0 s1 truck8)
   deleted: (at truck8 s0)
   added: (at truck8 s1)
   goals met: 37 of 41
153. (disembark-truck driver2 s1 truck8)
   deleted: (driving driver2 truck8)
   added: (at driver2 s1) (empty truck8)
   goals met: 38 of 41
154. (board-truck driver6 s4 truck2)
   deleted: (at driver6 s4) (empty truck2)
   added: (driving driver6 truck2)
   goals met: 38 of 41
155. (drive-truck driver6 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 39 of 41
156. (walk driver5 s6 p6-4)
   deleted: (at driver5 s6)
   added: (at driver5 p6-4)
   goals met: 39 of 41
157. (walk driver5 p6-4 s4)
   deleted: (at driver5 p6-4)
   added: (at driver5 s4)
   goals met: 39 of 41
158. (board-truck driver5 s4 truck3)
   deleted: (at driver5 s4) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 39 of 41
159. (drive-truck driver5 s4 s2 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   goals met: 40 of 41
160. (disembark-truck driver6 s2 truck2)
   deleted: (driving driver6 truck2)
   added: (at driver6 s2) (empty truck2)
   goals met: 41 of 41
